In [1]:

# Importing Libraries
import numpy as np
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt

# Loading Data
dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()

# Data Cleanup
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

/opt/anaconda3/envs/python_course/lib/python3.12/site-packages/tqdm/auto.py:21: TqdmWarning: IProgress not found. Please update jupyter and ipywidgets. See https://ipywidgets.readthedocs.io/en/stable/user_install.html
  from .autonotebook import tqdm as notebook_tqdm

In [29]:
df.loc[:, 'salary_rate':'salary_hour_avg'].dropna(subset="salary_hour_avg")

       salary_rate  salary_year_avg  salary_hour_avg
43            hour              NaN        97.500000
51            hour              NaN        72.500000
253           hour              NaN        88.000000
294           hour              NaN        52.500000
340           hour              NaN        67.500000
...            ...              ...              ...
784068        hour              NaN        54.420002
784267        hour              NaN        61.159996
785111        hour              NaN        61.159996
785476        hour              NaN        47.620003
785492        hour              NaN        47.620003

[10662 rows x 3 columns]